surajbenny/Embedded_Systems/STM32_2nd_batch/First_example/Driver_Dev/Src/Alternate_LED_Toggle.c
/*
 * Alternate_LED_Toggle.c
 *
 *  Created on: Feb 15, 2026
 *      Author: My PC
 */


#include "stm32_f446xx.h"
#include "stm32_f446xx_gpio_driver.h"



void delay(void) {
    for (uint32_t i = 0; i < 2000000; i++); // bigger loop
}



int main(void)
{

	GPIO_Handle_t GPIO_ALT_LED1_BLINK;
	GPIO_ALT_LED1_BLINK.pGPIOx = GPIOA;
	GPIO_ALT_LED1_BLINK.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUTPUT;
	GPIO_ALT_LED1_BLINK.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_ALT_LED1_BLINK.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PUPD_NO;
	GPIO_ALT_LED1_BLINK.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	GPIO_Init(&GPIO_ALT_LED1_BLINK);

	GPIO_Handle_t GPIO_ALT_LED2_BLINK;
	GPIO_ALT_LED2_BLINK.pGPIOx = GPIOA;
	GPIO_ALT_LED2_BLINK.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUTPUT;
	GPIO_ALT_LED2_BLINK.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GPIO_ALT_LED2_BLINK.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PUPD_NO;
	GPIO_ALT_LED2_BLINK.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	GPIO_Init(&GPIO_ALT_LED2_BLINK);

	while (1)
	    {
	        // Step 1: LED1 ON, LED2 OFF
	        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_6, 1);
	        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_7, 0);
	        delay(); // ~250ms ON

	        // Step 2: LED1 OFF, LED2 ON
	        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_6, 0);
	        GPIO_WriteToOutputPin(GPIOA, GPIO_PIN_NO_7, 1);
	        delay(); // ~250ms ON
	    }



	//uint8_t LED1 = GPIO_WriteToOutputPin(GPIOA,GPIO_PIN_NO_6,1);
	//uint8_t LED2 = GPIO_WriteToOutputPin(GPIOA,GPIO_PIN_NO_7,1);
}

